app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("text", "created_at", "updated_at") VALUES (?, ?, ?)  [["text", "It's due today. Hurry!"], ["created_at", 2017-01-27 11:56:37 UTC], ["updated_at", 2017-01-27 11:56:37 UTC]]
---
  def create
    @task = Task.new(task_params)
    if @task.save